Revit 2027 API
StructuralConnectionHandlerType.IsGeneric Method
 Checks if StructuralConnectionHandlerType is generic.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsGeneric()
Public Function IsGeneric As Boolean
public:
bool IsGeneric()
member IsGeneric : unit -> bool
Return Value
Boolean
 True if StructuralConnectionHandlerType is generic.
See Also
Reference
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace